def area(a, b):
    '''
    Возвращает площадь прямоугольника с заданными сторонами.
    
        Args:
            а (float): длина 1-й стороны прямоугольника
            b (float): длина 2-й стороны прямоугольника

        Returns:
            rectangle_area (float):  площадь прямоугольника со сторонами a, b

        Examples:
            area(4.5, 5.5)  # -> 24.75
    '''

    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника с заданными сторонами.
    
        Args:
            а (float): длина 1-й стороны прямоугольника
            b (float): длина 2-й стороны прямоугольника

        Returns:
            rectangle_perimetr (float):  периметр прямоугольника со сторонами a, b
    
        Examples:
            perimetr(4.5, 5.5)  # -> 20.0
    '''

    return 2 * (a + b)