def area(a, b):
    '''
    Возвращает площадь прямоугольника с заданными сторонами.
    
        Параметры:
            - а (float): длина 1-й стороны прямоугольника
            - b (float): длина 2-й стороны прямоугольника

        Возвращаемое значение:
            - rectangle_area (float):  площадь прямоугольника со сторонами a, b
    '''

    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника с заданными сторонами.
    
        Параметры:
            - а (float): длина 1-й стороны прямоугольника
            - b (float): длина 2-й стороны прямоугольника

        Возвращаемое значение:
            - rectangle_perimetr (float):  периметр прямоугольника со сторонами a, b
    '''

    return 2 * (a + b)