def area(a, h):
    '''
    Возвращает площадь треугольника с заданными сторонаой и высотой,
    проведенной к этой стороне.

    
        Args:
            а (float): длина стороны треугольника
            h (float): длина высоты, проведенной к этой стороне

        Returns:
            triangle_area (float):  площадь треугольника по стороне и проведенной к ней высоте

        Examples:
            area(2.3, 2.2)  # -> 2.53
    '''

    return (a * h) / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника с заданными сторонами.
    
        Args:
            a (float): длины 1 стороны треугольника соответственно
            b (float): длины 2 стороны треугольника соответственно
            c (float): длины 3 стороны треугольника соответственно


        Returns:
            triangle_perimetr (float):  периметр треугольника с заданными сторонами

        Examples:
            perimeter(2, 2, 2)      # -> 6.0
    '''

    return a + b + c