def area(a, h):
    '''
    Возвращает площадь треугольника с заданными сторонаой и высотой, 
    проведенной к этой стороне.
    
        Параметры:
            - а (float): длина стороны треугольника
            - h (float): длина высоты, проведенной к этой стороне

        Возвращаемое значение:
            - triangle_area (float):  площадь треугольника по стороне и 
            проведенной к ней высоте
    '''

    return (a * h) / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника с заданными сторонами.
    
        Параметры:
            - a, b, c (float): длины сторон треугольника соответственно

        Возвращаемое значение:
            - triangle_perimetr (float):  периметр треугольника с заданными сторонами
    '''

    return a + b + c